In [1]:
import pandas as pd

In [2]:
df = pd.read_excel(r'E-700 Pivot Data.xlsx', usecols = 'A', nrows = 4, header = 1)
df

                   Data
0  A-234, E-256, D-3673
1      Q-897, R-1, S-87
2     T-90, A-308, R-45
3    S-782, D-672, Q-29

In [3]:
a = sum(df.values.tolist(),[])
a = sum([x.split(', ') for x in a],[])
a = [x.split('-') for x in a]

In [4]:
df = pd.DataFrame(a, columns= ['Alphabets', 'Value'])
df = df.astype({'Value':float})
df = df.groupby(['Alphabets']).agg(Value = ('Value', 'sum')).reset_index()
df

  Alphabets   Value
0         A   542.0
1         D  4345.0
2         E   256.0
3         Q   926.0
4         R    46.0
5         S   869.0
6         T    90.0

In [5]:
total = pd.DataFrame([{'Alphabets':'Total', 'Value':df['Value'].sum()}])
total

  Alphabets   Value
0     Total  7074.0

In [6]:
result = pd.concat([df, total], ignore_index = True)
result

  Alphabets   Value
0         A   542.0
1         D  4345.0
2         E   256.0
3         Q   926.0
4         R    46.0
5         S   869.0
6         T    90.0
7     Total  7074.0